Revit 2026 API

# TableSectionDataGetColumnWidth Method

---

Returns a column's width in feet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetColumnWidth(
	int nCol
)
```
```vb
Public Function GetColumnWidth (
	nCol As Integer
) As Double
```
```cpp
public:
double GetColumnWidth(
	int nCol
)
```
```fsharp
member GetColumnWidth :
        nCol : int -> float
```

#### Parameters

nCol Int32

#### Return Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | The given column number nCol is invalid. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace